In [38]:
import numpy as np
import pandas as pd
#from pandas import read_csv
from pandas.plotting import autocorrelation_plot
from matplotlib import pyplot
#from sqlalchemy import create_engine

In [39]:
#!pip install mysql-connector-python

In [40]:
#import mysql
#import mysql.connector
import pyodbc

In [ ]:
# Connection To ODBC

In [41]:
conn = pyodbc.connect('Driver={SQL Server}; Server=ASUS; Trusted_Connection=No;')

In [ ]:
# Read from SQL

In [42]:

query="Select * from db2.dbo.ETL1"
df2 = pd.read_sql(query, conn)
df2.to_csv(r'd:/dataset/Pop2.csv')
#df = pd.read_sql("Select * from dbo.ETL1", conn)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [43]:
df2.head()

      Province Name  Population      Male    Female
0             Total    79926270  40498442  39427828
1           Markazi     1429475    725751    703724
2             Gilan     2530696   1267597   1263099
3        Mazandaran     3283582   1653998   1629584
4  East Azerbaijan      3909652   1989400   1920252